---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailEndTerminationAttachmentParam
source: html/0129dada-7385-3ff3-49af-e4033e29cb29.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailEndTerminationAttachmentParam Property

"Extension Style"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailEndTerminationAttachmentParam { get; }
```